web-api-helloworld/rust-actix/result-cpu-bound.txt
Running 1m test @ http://localhost:8000/cpu-bound
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms    1.90ms  19.92ms   92.32%
    Req/Sec    17.80k     1.21k   21.77k    84.44%
  4258558 requests in 1.06m, 597.01MB read
  Socket errors: connect 0, read 0, write 0, timeout 99
Requests/sec:  66897.72
Transfer/sec:      9.38MB