web-api-helloworld/rust-actix/result-io-bound.txt
Running 1m test @ http://localhost:8000/io-bound
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   101.44ms  432.24us 102.97ms   68.12%
    Req/Sec   246.76     19.08   252.00     95.71%
  59104 requests in 1.12m, 7.33MB read
  Socket errors: connect 0, read 0, write 0, timeout 200
Requests/sec:    879.20
Transfer/sec:    111.62KB